{
  "../09_VectorStore/images/tmp/0.jpg": "다양한 음식이 담긴 도시락입니다. 빵과 버터, 구운 브로콜리, 미트볼 소스, 말린 과일과 아몬드, 파인애플과 귤 조각, 초코칩 쿠키 등 균형 잡힌 영양 섭취를 위한 다채로운 구성입니다.  알록달록한 작은 용기들에 음식이 담겨 있어 보기에도 좋습니다.",
  "../09_VectorStore/images/tmp/1.jpg": "나무가 우거진 동물원 우리 안에서 두 마리의 기린이 보입니다. 한 마리는 나무에서 먹이를 먹고 있고, 다른 한 마리는 땅에서 풀을 뜯고 있습니다.  햇살이 비추는 밝은 분위기의 사진입니다.",
  "../09_VectorStore/images/tmp/2.jpg": "하얀색 도자기 화병에 흰색과 분홍색 꽃이 아름답게 어우러져 있습니다. 싱그러운 녹색 정원을 배경으로 화병이 흰 난간 위에 놓여 있으며, 햇살이 부드럽게 비추고 있습니다.  잔잔하고 평화로운 분위기를 자아내는 풍경입니다.",
  "../09_VectorStore/images/tmp/3.jpg": "초록색 풀밭에서 얼룩말 한 마리가 풀을 뜯어 먹고 있습니다.  얼룩말의 검정색과 흰색 줄무늬가 선명하게 드러나며, 몸 전체의 줄무늬 패턴이 잘 보입니다.  사진은 얼룩말의 옆모습을 가까이서 촬영한 것입니다.",
  "../09_VectorStore/images/tmp/4.jpg": "분홍색 우산을 든 여성이 해변에서 웃고 있습니다. 그녀는 꽃무늬 수영복을 입고 있으며, 배경에는 호수와 나무들이 보입니다. 사진은 밝고 긍정적인 분위기를 자아냅니다.",
  "../09_VectorStore/images/tmp/5.jpg": "갈색 푸들이 신발장 선반 위에 여러 종류의 신발들 사이에 잠들어 있습니다.  신발들은 슬리퍼, 운동화 등 다양하며, 푸들은 신발들에 파묻히듯 편안하게 잠들어 있는 모습입니다.  사진은 좁은 신발장 안의 아늑한 분위기를 보여줍니다.",
  "../09_VectorStore/images/tmp/6.jpg": "초록색 잔디밭에서 두 명의 기수가 각각 흰색과 검은색 말을 타고 장애물을 뛰어넘는 묘기를 선보이고 있습니다. 기수들은 흰색과 파란색 유니폼을 착용하고 있으며, 말들은 뛰어오르는 역동적인 자세를 취하고 있습니다. 배경에는 푸른 나무들이 우거진 공원이 보입니다.",
  "../09_VectorStore/images/tmp/7.jpg": "무성한 열대 우림 속에서 두 마리의 코끼리가 관광객들을 태우고 이동하고 있습니다.  코끼리들은 숲의 덤불 사이로 천천히 나아가고 있으며, 관광객들은 코끼리 등에 올라타 숲을 즐기고 있습니다.  이 사진은 코끼리 사파리 또는 유사한 관광 활동을 보여줍니다.",
  "../09_VectorStore/images/tmp/8.jpg": "사진은 로렉스 로고가 새겨진 큰 시계가 서 있는 거리 풍경을 보여줍니다. 시계는 검은색 기둥에 설치되어 있으며, 주변에는 나무와 주차된 차량, 그리고 건물들이 보입니다.  린컨 거리 표지판도 함께 보이는 것으로 보아,  미국 거리의 모습을 담은 사진으로 추정됩니다.",
  "../09_VectorStore/images/tmp/9.jpg": "사진은 여러 개의 객차로 이루어진 기차가 선로를 따라 달리는 모습을 보여줍니다. 기차는 흰색과 빨간색, 파란색으로 되어 있으며, 배경에는 건물과 창고들이 보입니다.  선로는 곡선으로 이어져 있으며 주변은 공장 지역으로 보입니다.",
  "../09_VectorStore/images/tmp/10.jpg": "두 마리의 기린이 나무 사이에서 서로 목을 얽어매고 있습니다.  서로 장난치거나 싸우는 모습으로 보이며,  초록빛 나무들이 배경을 이룹니다.  기린의 독특한 얼룩무늬가 잘 드러납니다.",
  "../09_VectorStore/images/tmp/11.jpg": "사진은 고전 오토바이, 아마도 빈티지 모델을 보여줍니다.  은색과 검은색으로 된 차체와  'SV-6260' 번호판이 부착되어 있습니다.  오토바이는 잘 보존된 상태로 보이며, 클래식 오토바이 애호가들에게 관심을 끌 만합니다.",
  "../09_VectorStore/images/tmp/12.jpg": "좁은 유럽풍 거리에 하얀 개 한 마리가 자고 있습니다. 자전거가 벽에 기대어 서 있고, 배경에는 사람들이 흐릿하게 보입니다. 조용하고 평화로운 분위기의 골목길 풍경입니다.",
  "../09_VectorStore/images/tmp/13.jpg": "그래피티로 가득한 스케이트보드장에서 젊은이들이 스케이트보드를 타고 있습니다.  몇몇은 공중에서 기술을 선보이고 있으며, 다른 한 명은 램프 아래에서 스케이트보드를 타고 있습니다.  밝은 햇살 아래, 활기찬 분위기가 느껴집니다.",
  "../09_VectorStore/images/tmp/14.jpg": "사진에는 부드러운 색감의 탁상시계와 촛불이 켜진 올빼미 모양의 촛대가 함께 놓여 있습니다.  앤티크한 분위기의 소품들이 따뜻하고 아늑한 분위기를 연출하고 있습니다.  두 물건의 조화가 편안하고 차분한 느낌을 자아냅니다.",
  "../09_VectorStore/images/tmp/15.jpg": "사진은 에어프랑스 항공의 에어버스 A380 여객기가 구름 위를 비행하는 모습을 보여줍니다.  기체에는 에어프랑스 로고가 선명하게 보이며,  비행 중인 대형 항공기의 역동적인 모습을 담고 있습니다.",
  "../09_VectorStore/images/tmp/16.jpg": "흑백 사진 속 한 남자가 하드리-데이비슨 오토바이에 앉아 우편함에 편지를 넣고 있습니다.  그는 모자를 쓰고 셔츠를 입은 채, 짐을 싣고 있는 오토바이를 타고 있습니다. 사진은 숲길에서 찍힌 것으로 보입니다.",
  "../09_VectorStore/images/tmp/17.jpg": "설명 생성 실패",
  "../09_VectorStore/images/tmp/18.jpg": "설명 생성 실패",
  "../09_VectorStore/images/tmp/19.jpg": "설명 생성 실패"
}